function task(func) {
  func();
}

//-----------------------------------------------------------------------------------------task 6.2------------------------------------------------------------------------------------------//

function t62() {

  let morningList = [
    'Встать с кровати',
    'Почистить зубы',
    'Проверить сториз',
    'Позавтракать'
  ];

  let n62 = (morningList.length);
  console.log(morningList[0]);
  console.log(morningList[n62 - 1]); 

}

//-----------------------------------------------------------------------------------------task 6.3------------------------------------------------------------------------------------------//

function t63() {

  morningList = [
    'Встать с кровати',
    'Почистить зубы',
    'Сделать зарядку',
    'Проверить сториз',
    'Позавтракать',
    'Помыть посуду'
  ];

  console.log(morningList); 

}

//-----------------------------------------------------------------------------------------task 7.1------------------------------------------------------------------------------------------//

function t71() {

  let morningList = [
    'Встать с кровати',
    'Почистить зубы',
    'Проверить сториз',
    'Позавтракать'
  ];

  for (let n71 = 0; n71 <= 3; n71 = n71 + 1) {
    console.log(morningList[n71]);
  }

}

//-----------------------------------------------------------------------------------------task 7.2------------------------------------------------------------------------------------------//

function t72() {

  let morningList = [
    'Встать с кровати',
    'Почистить зубы',
    'Проверить сториз',
    'Позавтракать'
  ];

  for (let n72 = 0; n72 <= 3; n72 += 2) {
    console.log(morningList[n72]);
  }

}

//-----------------------------------------------------------------------------------------task 7.3------------------------------------------------------------------------------------------//

function t73() {

  let morningList = [
    'Встать с кровати',
    'Почистить зубы',
    'Проверить сториз',
    'Позавтракать'
  ];

  let n73 = 0
  while (n73 <= 3) {
    console.log(morningList[n73]);
    n73 ++;
  }

}

//--------------------------------------------------------------------------------------summon a tasks---------------------------------------------------------------------------------------//















































































//Создано Ульяновым Т.