function task(func) {
  func();
}

//-----------------------------------------------------------------------------------------task 5.3------------------------------------------------------------------------------------------//

function t53() {

  let year = 2019;

  if (year % 4 === 0) {
    console.log(year + ' год - високосный');
  } 
  else {
    console.log(year + ' год - невисокосный');
  }

}

//-----------------------------------------------------------------------------------------task 5.4------------------------------------------------------------------------------------------//

function t54() {

  let year = 1800;
  let yCheck1 = (year % 400 === 0);
  let yCheck2_1 = (year % 4 === 0);
  let yCheck2_2 = (year % 100 !== 0);

  if (yCheck1) {
    console.log(year + ' год - високосный');
  } 
  else if (yCheck2_1 && yCheck2_2) {
    console.log(year + ' год - високосный');
  }
  else {
    console.log(year + ' год - невисокосный');
  }

}

//--------------------------------------------------------------------------------------summon a tasks---------------------------------------------------------------------------------------//









































































//Создано Ульяновым Т.