function task(func) {
    func();
}

//-----------------------------------------------------------------------------------------task 8.1------------------------------------------------------------------------------------------//

function t81() {

    let counter = 0;

    function increaseCounter() {
        counter++;
    }

    for (n81 = 0; n81 < 3; n81++) {
    increaseCounter();
    console.log(counter);
    };
    
}

//-----------------------------------------------------------------------------------------task 8.2------------------------------------------------------------------------------------------//

function t82() {

    function isLeapYear() {
        let year = 2020;
        let n82_1 = ' год - високосный';
        let n82_2 = ' год - невисокосный';
        let yCheck1 = (year % 400 === 0);
        let yCheck2_1 = (year % 4 === 0);
        let yCheck2_2 = (year % 100 !== 0);
        if (yCheck1 || yCheck2_1 && yCheck2_2) {
            console.log(year + n82_1);
        }
        else {
            console.log(year + n82_2);
        }
    }

}

//-----------------------------------------------------------------------------------------task 8.3------------------------------------------------------------------------------------------//

function t83() {

    function isLeapYear(year) {
        let n82_1 = ' год - високосный';
        let n82_2 = ' год - невисокосный';
        let yCheck1 = (year % 400 === 0);
        let yCheck2_1 = (year % 4 === 0);
        let yCheck2_2 = (year % 100 !== 0);
        if (yCheck1 || yCheck2_1 && yCheck2_2) {
            console.log(year + n82_1);
        }
        else {
            console.log(year + n82_2);
        }
    }

}

//-----------------------------------------------------------------------------------------task 8.4------------------------------------------------------------------------------------------//                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      //Создано Ульяновым Т.                            

function t84() {

    function isLeapYear(year) {
        let n82_1 = ' год - високосный';
        let n82_2 = ' год - невисокосный';
        let yCheck1 = (year % 400 === 0);
        let yCheck2_1 = (year % 4 === 0);
        let yCheck2_2 = (year % 100 !== 0);
        if (yCheck1 || yCheck2_1 && yCheck2_2) {
            console.log(year + n82_1);
        }
        else {
            console.log(year + n82_2);
        }
    }

    for (year = 2020; year < 2023; year++) {
        isLeapYear(year);
    };

}
    
//-----------------------------------------------------------------------------------------task 8.5------------------------------------------------------------------------------------------//

function t85() {

    function isLeapYear(year) {
        let n82_1 = ' год - високосный';
        let n82_2 = ' год - невисокосный';
        let yCheck1 = (year % 400 === 0);
        let yCheck2_1 = (year % 4 === 0);
        let yCheck2_2 = (year % 100 !== 0);
        if (yCheck1 || yCheck2_1 && yCheck2_2) {
            return year + n82_1;
        }
        else {
            return year + n82_2;
        }
    }

}

//-----------------------------------------------------------------------------------------task 8.6------------------------------------------------------------------------------------------//

function t86() {

    function isLeapYear(year) {
        let n82_1 = ' год - високосный';
        let n82_2 = ' год - невисокосный';
        let yCheck1 = (year % 400 === 0);
        let yCheck2_1 = (year % 4 === 0);
        let yCheck2_2 = (year % 100 !== 0);
        if (yCheck1 || yCheck2_1 && yCheck2_2) {
            return year + n82_1;
        }
        else {
            return year + n82_2;
        }
    }

    for (year = 2020; year < 2021; year++) {
        checkResult = isLeapYear(year);
    };

    alert(checkResult);

}

//--------------------------------------------------------------------------------------summon a tasks---------------------------------------------------------------------------------------//                                                                                                                                                                                  //Сделано Ульяновым Т.
